JackTJH/STM32F407/23_AD7746/APPLICATION/AD9833/ad9833.h
#ifndef __AD9833_H
#define __AD9833_H

#ifdef __cplusplus
	extern "C" {
#endif

#include "stm32f4xx.h"
#include "hspi.h"

typedef struct
{
	uint16_t frequent;
	uint16_t Phase;
}	AD9833_Typedef;

extern AD9833_Typedef AD9833_1;

//时钟速率为25 MHz时， 可以实现0.1 Hz的分辨率；而时钟速率为1 MHz时，则可以实现0.004 Hz的分辨率。
//调整参考时钟修改此处即可。
#define FCLK 25000000	//设置参考时钟25MHz，板默认板载晶振频率25Mhz。

#define RealFreDat    268435456.0/FCLK//总的公式为 Fout=（Fclk/2的28次方）*28位寄存器的值

/******************************************************************************/
/* AD9833                                                                    */
/******************************************************************************/
/* 寄存器 */

#define AD9833_REG_CMD		(0 << 14)
#define AD9833_REG_FREQ0	(1 << 14)
#define AD9833_REG_FREQ1	(2 << 14)
#define AD9833_REG_PHASE0	(6 << 13)
#define AD9833_REG_PHASE1	(7 << 13)

/* 命令控制位 */

#define AD9833_B28				(1 << 13)
#define AD9833_HLB				(1 << 12)
#define AD9833_FSEL0			(0 << 11)
#define AD9833_FSEL1			(1 << 11)
#define AD9833_PSEL0			(0 << 10)
#define AD9833_PSEL1			(1 << 10)
#define AD9833_PIN_SW			(1 << 9)
#define AD9833_RESET			(1 << 8)
#define AD9833_SLEEP1			(1 << 7)
#define AD9833_SLEEP12		(1 << 6)
#define AD9833_OPBITEN		(1 << 5)
#define AD9833_SIGN_PIB		(1 << 4)
#define AD9833_DIV2				(1 << 3)
#define AD9833_MODE				(1 << 1)

#define AD9833_OUT_SINUS		((0 << 5) | (0 << 1) | (0 << 3))//正弦波 
#define AD9833_OUT_TRIANGLE	((0 << 5) | (1 << 1) | (0 << 3))//三角波
#define AD9833_OUT_MSB			((1 << 5) | (0 << 1) | (1 << 3)) //方波
#define AD9833_OUT_MSB2			((1 << 5) | (0 << 1) | (0 << 3))
		
void AD9833_SetRegisterValue(unsigned short regValue,SPI_TYPE spi_type,SPIX_Typedef spix);
void AD9833_SetFrequency(unsigned short reg, float fout,unsigned short type,SPI_TYPE spi_type,SPIX_Typedef spix);
void AD9833_SetFrequencyQuick(float fout,unsigned short type,SPI_TYPE spi_type,SPIX_Typedef spix);

void AD9833_Reset(SPI_TYPE spi_type,SPIX_Typedef spix);
void AD9833_ClearReset(SPI_TYPE spi_type,SPIX_Typedef spix);
void AD9833_SetPhase(unsigned short reg, unsigned short val,SPI_TYPE spi_type,SPIX_Typedef spix);
void AD9833_Setup(unsigned short freq, unsigned short phase,unsigned short type,SPI_TYPE spi_type,SPIX_Typedef spix);
void AD9833_SetWave(unsigned short type,SPI_TYPE spi_type,SPIX_Typedef spix);
		
		
#ifdef __cplusplus
	}
#endif


#endif		